#ifndef COMMON_H
#define COMMON_H		// 二回目の読み出し禁止用

/***********************************************
* 定数の宣言
***********************************************/

#include "DxLib.h"
#define _USE_MATH_DEFINES
#include "math.h"




/***********************************************
* 変数の宣言
***********************************************/
extern int OldKey;		// 前回の入力キー
extern int NowKey;		// 今回の入力キー
extern int KeyFlg;		// 入力キー情報
extern int GameMode;		// ゲームモード



/***********************************************
* 自機の構造体
***********************************************/



#endif